#+SETUPFILE: /home/cayek/.src/org-html-themes/setup/theme-readtheorg.setup
#+PROPERTY: header-args:R  :session *R-loadforecast* :exports results :eval no-export

The February 2017 an energy consumption foretasting challenge was launched on
the website driven data ([[https://www.drivendata.org/competitions/51/electricity-prediction-machine-learning/][Power Laws: Forecasting Energy Consumption]]). We use the
energy consumption data provided for this challenge to build a forecast
algorithm based on boosted trees and auto regressive model.

* Model1: xgboost

We firstly we build a model without tuning the parameters.

#+NAME: code_xgb
#+CAPTION: This code chunk depends on chunk [[code_prepare]] 
#+BEGIN_SRC R :session *R-loadforecast*
library(tidyverse)
library(glue)
library(lubridate)
library(plotly)
library(zoo)
library(xgboost)

## retrieve data frame 
train_df <- readRDS('./cache/kazlab-poc-dumps/R/train_df.rds')
test_df <- readRDS('./cache/kazlab-poc-dumps/R/test_df.rds')

## retrieve the dmatrix
dtest <- xgb.DMatrix("./cache/kazlab-poc-dumps/R/test.txt")
dtrain <- xgb.DMatrix("./cache/kazlab-poc-dumps/R/train.txt")

## xgboost
## list of vector to test fold's indices
## reduce the number of folds
nfolds = 10
train_df <- train_df %>%
  mutate(ForecastId = ForecastId %% nfolds)
folds <- sapply(unique(train_df$ForecastId),
                function(id){which(train_df$ForecastId == id)}, simplify = FALSE)

## cross validation for the number of trees
params <- list(
  booster = "gbtree", ## descision tree
  eta = 0.1, ## learning rate
  nthread = 8, ## number of thread
  max_depth = 6, ## max depth of tree
  subsample = 0.8, ## subsample rows
  colsample_bytree = 1.0, ## 1 means features are not sampled
  objective = "reg:linear") ## regression
early_stopping_rounds <- 30 ## stop is the error do not decrease after 30 iterations
nrounds <- 800 ## number max of tree
verbose <- 1 ## plot errors

## cross validation with xgboost
bst.cv <- xgboost::xgb.cv(params = params,
                          data = dtrain,
                          early_stopping_rounds = early_stopping_rounds,
                          nrounds = nrounds,
                          metrics = "rmse",
                          nfold = nfold,
                          folds = folds,
                          verbose = verbose)
best_ntreelimit <- bst.cv$best_ntreelimit
#+END_SRC

#+NAME: code_fit_xgb
#+CAPTION: This code chunk depends on chunk [[code_prepare]] 
#+begin_src R :session *R-loadforecast*
## train the model
bst <- xgboost::xgb.train(params = params,
                          data = dtrain,
                          nrounds = best_ntreelimit,
                          verbose = verbose,
                          watchlist = list(test = dtest))

test_df <- test_df %>%
  mutate(predicted_Load = predict(bst, dtest))

train_df <- train_df %>%
  mutate(predicted_Load = predict(bst, dtrain))

## plot
p <- plot_ly(test_df, x = ~Timestamp,
             y = ~target, type = 'scatter', mode = 'lines',
             name = "consumption") %>%
  add_trace(y = ~predicted_Load, mode = "lines",
            name = "predicted consumption")
dump_plot(p, "/home/cayek/cache/kazlab-poc-dumps/plots/xgb1.html", FALSE)


## plot the train
p <- plot_ly(train_df, x = ~Timestamp,
             y = ~target, type = 'scatter', mode = 'lines',
             name = "consumption") %>%
  add_trace(y = ~predicted_Load, mode = "lines",
            name = "predicted consumption")
dump_plot(p, "/home/cayek/cache/kazlab-poc-dumps/plots/xgb1_train.html", FALSE)

## dumps
saveRDS(train_df, "./cache/kazlab-poc-dumps/R/train_df_xgb.rds")
saveRDS(test_df, "./cache/kazlab-poc-dumps/R/test_df_xgb.rds")
#+end_src

This first model get an average prediction error of 3877 kW, which represent
around 10 percent of the average consumption.

#+NAME: code_xgb_err
#+CAPTION: This code chunk depends on chunk [[code_fit_xgb]] 
#+BEGIN_SRC R  :results output raw
library(Metrics)
library(ascii)

test_df <- readRDS("./cache/kazlab-poc-dumps/R/test_df_xgb.rds")

## compute error
aux_df <- test_df %>% summarise(`root mean average error` = rmse(target, predicted_Load),
                                `mean absolute error` = mae(target, predicted_Load),
                                `mean consumption` = mean(target),
                                `median consumption` = median(target))
## print
ascii(aux_df) %>%  print(type="org")
#+END_SRC

#+RESULTS: code_xgb_err
|   | root mean average error | mean absolute error | mean consumption | median consumption |
|---+-------------------------+---------------------+------------------+--------------------|
| 1 | 5820.37                 | 3877.06             | 33487.80         | 27928.97           |

The following graph show the forecast and actual consumption.
#+BEGIN_EXPORT html
<iframe src="./plots/xgb1.html"
        height="600" width="100%"
        scrolling="no" seamless="seamless"
        frameBorder="0">
</iframe>
#+END_EXPORT

